app/controllers/candidates_controller.rb

  def index
    @candidates = Candidate.all
---
SELECT "candidates".* FROM "candidates"

  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("full_name", "gender", "age", "speciality", "work_experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @candidate.update(candidate_params)
---
UPDATE "candidates" SET "age" = ?, "speciality" = ?, "work_experience" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["age", 27], ["speciality", "Lawyer"], ["work_experience", "3 years of job"], ["updated_at", "2022-12-10 14:14:02.660400"], ["id", 6]]

    def set_candidate
      @candidate = Candidate.find(params[:id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]